simulation data/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10.45 0 0);

boundaryField
{
    bottomWall
    {
        type            noSlip;
    }
    CLARK_Y_AIRFOIL
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    side1
    {
        type            symmetry;
    }
    side2
    {
        type            symmetry;
    }
    tap1
    {
        type flowRateInletVelocity;
        volumetricFlowRate constant 1.666e-5; //Q=0.5 lit/min
        value uniform (0 0 0);
    }
    tap5
    {
        type            noSlip;
    }
    upperWall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
