simulation data/0/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    CLARK_Y_AIRFOIL
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    side1
    {
        type            symmetry;
    }
    side2
    {
        type            symmetry;
    }
    tap1
    {
        type            fixedValue;
        value           uniform 0;
    }
    tap5
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
