simulation data/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid vapour air);; //The first phase is always considered the primary phase //
phaseChangeThreePhaseMixture  SchnerrSauer3;
pSat                        2728.0;
sigma                       0.07;

sigma12         0.07; //from paper in mendeley
sigma13         0.07;  //Water against Air
sigma23         0.0;  //Vapor against Air



liquid
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.003e-6;	
    rho             [1 -3 0 0 0 0 0] 998.25;		
}

vapour
{
    transportModel Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.34e-5;	
    rho             [1 -3 0 0 0 0 0] 0.017;	
}

air
 {
     transportModel Newtonian;
     nu              [0 2 -1 0 0 0 0] 1.51e-5; 
     rho             [1 -3 0 0 0 0 0] 1.204;
 }

KunzCoeffs
{
    UInf            20.0;
    tInf            0.005; // L = 0.1 m
    Cc              1000;
    Cv              1000;
}

MerkleCoeffs
{
    UInf            20.0;
    tInf            0.005;  // L = 0.1 m
    Cc              80;
    Cv              1e-03;
}

SchnerrSauer3Coeffs
{
    n               1.0e+09; 
    dNuc            1.1e-05; 
    Cc              1;
    Cv              1;
}

// ************************************************************************* //
