simulation data/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

F_Hydrofoil
{
    type          forces;
    libs          ("libforces.so");
    writeControl  timeStep;
    timeInterval  1;
    patches       (CLARK_Y_AIRFOIL);
    rho           rhoInf;
    log           false;
    rhoInf        997;
    CofR          (0 0 0); 
    pitchAxis     (0 0 1);
    pName           p_rgh;
//	outputInterval      1;
}


// ************************************************************************* //    forces

